# Merging of Two Data Frames Based on a Common ID
## Equivalent to SQL Join

In [2]:
import pandas as pd

    ID     Sex  Age  Salary Job_Satisfaction
0  113    Male   30   50000             High
1  114  Female   28   60000           Medium
2  115    Male   35   55000              Low

In [3]:
# Create Sample data frame A.
df_A = pd.DataFrame({'ID': ['113', '114', '115'], 
                      'Sex': ['Male', 'Female', 'Male'], 
                      'Age': [30, 28, 35]})
df_A

    ID     Sex  Age
0  113    Male   30
1  114  Female   28
2  115    Male   35

In [4]:
# Create Sample Data Frame B
df_B = pd.DataFrame({'ID': ['113', '114', '115'], 
                      'Salary': [50000, 60000, 55000], 
                      'Job_Satisfaction': ['High', 'Medium', 'Low']})
df_B

    ID  Salary Job_Satisfaction
0  113   50000             High
1  114   60000           Medium
2  115   55000              Low

In [5]:
# Merge the dataframes on the ID column
df_combined = pd.merge(df_A, df_B, on='ID')
df_combined

    ID     Sex  Age  Salary Job_Satisfaction
0  113    Male   30   50000             High
1  114  Female   28   60000           Medium
2  115    Male   35   55000              Low